InformationRegisters/ПоляЗамеровПоТипамИзделия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПоляЗамеровПоТипамИзделия</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Комм</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВПрайс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипИзделия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗначенияСвойствОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПолеЗамера</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоляЗамеров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Замеры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>Замеры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Замер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поле</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПолеЗамера</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоляЗамеров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Полнота</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПолеРус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗначенияСвойствОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияСвойствОбъектов</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СвойстваОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СвойстваОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗамерыПоля.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ЗамерыПоля</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Комм</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВПрайс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипИзделия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗначенияСвойствОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поле</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПолеРус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПолеПеревод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ПоляЗамеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ПоляЗамеров</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеРус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПеревод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ЗамерыНоменклатуры/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Замеры номенклатуры.
//
// Названия полей замеров хранятся в справочнике ПоляЗамеров (три языка:
// Наименование - укр., НаименованиеРус, НаименованиеПеревод), набор полей
// для типа изделия - в регистре ПоляЗамеровПоТипамИзделия, значения замеров -
// в регистре Замеры (измерение ПолеЗамера).
//
// Переименование поля теперь меняет только наименование элемента справочника:
// записи замеров хранят ссылку, перезаписывать регистр не нужно.
//
// Строковые измерения Замеры.Поле/ПолеРус пишутся параллельно со ссылкой,
// пока переходный период не закончен и старая форма ФормаЗамеры ещё жива.
////////////////////////////////////////////////////////////////////////////////

// Код свойства "Тип изделия" в плане видов характеристик СвойстваОбъектов.
Функция КодСвойстваТипИзделия() Экспорт
	Возврат "000000037";
КонецФункции

// Код свойства "Размер".
Функция КодСвойстваРазмер() Экспорт
	Возврат "000000099";
КонецФункции

Функция ТипИзделия(Номенклатура) Экспорт
	Возврат ОбщегоНазначения.СвойстваОбъекта(Номенклатура, КодСвойстваТипИзделия());
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Справочник полей и привязка к типам изделия.

// Поля замеров, заданные для типа изделия.
// Колонки: Поле, Наименование, НаименованиеРус, НаименованиеПеревод, ВПрайс, Порядок.
Функция ПоляТипаИзделия(ТипИзделия) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Поля.ПолеЗамера КАК Поле,
	               |	Поля.ПолеЗамера.Наименование КАК Наименование,
	               |	Поля.ПолеЗамера.НаименованиеРус КАК НаименованиеРус,
	               |	Поля.ПолеЗамера.НаименованиеПеревод КАК НаименованиеПеревод,
	               |	Поля.ВПрайс КАК ВПрайс,
	               |	Поля.Порядок КАК Порядок,
	               |	Поля.Комм КАК Комм
	               |ИЗ
	               |	РегистрСведений.ПоляЗамеровПоТипамИзделия КАК Поля
	               |ГДЕ
	               |	Поля.ТипИзделия = &ТипИзделия
	               |	И НЕ Поля.ПолеЗамера.ПометкаУдаления
	               |	И Поля.ПолеЗамера <> ЗНАЧЕНИЕ(Справочник.ПоляЗамеров.ПустаяСсылка)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Поля.Порядок,
	               |	Наименование";
	Запрос.УстановитьПараметр("ТипИзделия", ТипИзделия);

	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

// Ищет поле замера по украинскому наименованию, при отсутствии создаёт новое.
Функция ПолеПоНаименованию(Наименование, НаименованиеРус = "", НаименованиеПеревод = "", Создавать = Истина) Экспорт

	Наим = СокрЛП(Наименование);
	Если ПустаяСтрока(Наим) Тогда
		Возврат Справочники.ПоляЗамеров.ПустаяСсылка();
	КонецЕсли;

	Поле = Справочники.ПоляЗамеров.НайтиПоНаименованию(Наим, Истина);
	Если ЗначениеЗаполнено(Поле) Тогда
		ДозаполнитьНазвания(Поле, НаименованиеРус, НаименованиеПеревод);
		Возврат Поле;
	КонецЕсли;

	Если НЕ Создавать Тогда
		Возврат Справочники.ПоляЗамеров.ПустаяСсылка();
	КонецЕсли;

	Объект = Справочники.ПоляЗамеров.СоздатьЭлемент();
	Объект.Наименование = Наим;
	Объект.НаименованиеРус = СокрЛП(НаименованиеРус);
	Объект.НаименованиеПеревод = СокрЛП(НаименованиеПеревод);
	Объект.Записать();

	Возврат Объект.Ссылка;

КонецФункции

// Заполняет пустые переводы у существующего поля, не затирая уже введённые.
Процедура ДозаполнитьНазвания(Поле, НаименованиеРус, НаименованиеПеревод)

	Если ПустаяСтрока(НаименованиеРус) И ПустаяСтрока(НаименованиеПеревод) Тогда
		Возврат;
	КонецЕсли;

	НужнаЗапись = (ПустаяСтрока(Поле.НаименованиеРус) И НЕ ПустаяСтрока(НаименованиеРус))
		ИЛИ (ПустаяСтрока(Поле.НаименованиеПеревод) И НЕ ПустаяСтрока(НаименованиеПеревод));
	Если НЕ НужнаЗапись Тогда
		Возврат;
	КонецЕсли;

	Объект = Поле.ПолучитьОбъект();
	Если ПустаяСтрока(Объект.НаименованиеРус) Тогда
		Объект.НаименованиеРус = СокрЛП(НаименованиеРус);
	КонецЕсли;
	Если ПустаяСтрока(Объект.НаименованиеПеревод) Тогда
		Объект.НаименованиеПеревод = СокрЛП(НаименованиеПеревод);
	КонецЕсли;
	Объект.Записать();

КонецПроцедуры

// Привязывает поле к типу изделия. Повторный вызов просто обновляет реквизиты.
Процедура ПривязатьПоле(ТипИзделия, Поле, ВПрайс = Ложь, Порядок = 0, Комм = "") Экспорт

	Если НЕ ЗначениеЗаполнено(ТипИзделия) ИЛИ НЕ ЗначениеЗаполнено(Поле) Тогда
		Возврат;
	КонецЕсли;

	Запись = РегистрыСведений.ПоляЗамеровПоТипамИзделия.СоздатьМенеджерЗаписи();
	Запись.ТипИзделия = ТипИзделия;
	Запись.ПолеЗамера = Поле;
	Запись.ВПрайс = ВПрайс;
	Запись.Порядок = Порядок;
	Запись.Комм = Лев(СокрЛП(Комм), 50);
	Запись.Записать(Истина);

КонецПроцедуры

// Переключает у поля признак "в прайс". Возвращает установленное значение.
Функция ПереключитьВПрайс(ТипИзделия, Поле) Экспорт

	Запись = РегистрыСведений.ПоляЗамеровПоТипамИзделия.СоздатьМенеджерЗаписи();
	Запись.ТипИзделия = ТипИзделия;
	Запись.ПолеЗамера = Поле;
	Запись.Прочитать();

	Если НЕ Запись.Выбран() Тогда
		Возврат Ложь;
	КонецЕсли;

	Запись.ВПрайс = НЕ Запись.ВПрайс;
	Запись.Записать(Истина);

	Возврат Запись.ВПрайс;

КонецФункции

// Двигает поле в наборе типа изделия: Сдвиг = -1 левее, +1 правее.
Процедура СдвинутьПоле(ТипИзделия, Поле, Сдвиг) Экспорт

	Поля = ПоляТипаИзделия(ТипИзделия);

	СтрокаПоля = Поля.Найти(Поле, "Поле");
	Если СтрокаПоля = Неопределено Тогда
		Возврат;
	КонецЕсли;

	НовыйИндекс = Поля.Индекс(СтрокаПоля) + Сдвиг;
	Если НовыйИндекс < 0 ИЛИ НовыйИндекс > Поля.Количество() - 1 Тогда
		Возврат;
	КонецЕсли;

	Поля.Сдвинуть(СтрокаПоля, Сдвиг);

	// перенумеровываем весь набор: так порядок остаётся однозначным,
	// даже если раньше у всех полей стояли нули
	Порядок = 0;
	Для Каждого Стр Из Поля Цикл
		Порядок = Порядок + 10;
		Если Стр.Порядок = Порядок Тогда
			Продолжить;
		КонецЕсли;
		ПривязатьПоле(ТипИзделия, Стр.Поле, Стр.ВПрайс, Порядок, Стр.Комм);
	КонецЦикла;

КонецПроцедуры

Процедура ОтвязатьПоле(ТипИзделия, Поле) Экспорт

	Запись = РегистрыСведений.ПоляЗамеровПоТипамИзделия.СоздатьМенеджерЗаписи();
	Запись.ТипИзделия = ТипИзделия;
	Запись.ПолеЗамера = Поле;
	Запись.Удалить();

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Матрица "размеры x поля".

// Размеры номенклатуры: и те, по которым замеры уже введены, и те,
// что есть в характеристиках (свойство "Размер").
// Колонки: Размер, Полнота, РазмерЧисло.
Функция РазмерыНоменклатуры(Номенклатура) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	Замеры.Размер КАК Размер,
	               |	Замеры.Полнота КАК Полнота
	               |ИЗ
	               |	РегистрСведений.Замеры КАК Замеры
	               |ГДЕ
	               |	Замеры.Номенклатура = &Номенклатура
	               |
	               |ОБЪЕДИНИТЬ
	               |
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВЫРАЗИТЬ(ЗначенияСвойств.Значение.Наименование КАК СТРОКА(20)),
	               |	""""
	               |ИЗ
	               |	Справочник.ХарактеристикиНоменклатуры КАК Характеристики
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойств
	               |		ПО ЗначенияСвойств.Объект = Характеристики.Ссылка
	               |			И ЗначенияСвойств.Свойство = &СвойствоРазмер
	               |ГДЕ
	               |	Характеристики.Владелец = &Номенклатура
	               |	И НЕ Характеристики.ПометкаУдаления";

	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("СвойствоРазмер", ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду(КодСвойстваРазмер()));

	Таблица = Запрос.Выполнить().Выгрузить();
	Таблица.Колонки.Добавить("РазмерЧисло", Новый ОписаниеТипов("Число"));

	Для Каждого Стр Из Таблица Цикл
		Стр.Размер = СокрЛП(Стр.Размер);
		Стр.Полнота = СокрЛП(Стр.Полнота);
		Попытка
			Стр.РазмерЧисло = Число(Стр.Размер);
		Исключение
			Стр.РазмерЧисло = 0;
		КонецПопытки;
	КонецЦикла;

	Таблица.Свернуть("Размер,Полнота,РазмерЧисло");

	// пустые размеры не показываем - вводить замер некуда
	Индекс = Таблица.Количество() - 1;
	Пока Индекс >= 0 Цикл
		Если ПустаяСтрока(Таблица[Индекс].Размер) Тогда
			Таблица.Удалить(Индекс);
		КонецЕсли;
		Индекс = Индекс - 1;
	КонецЦикла;

	Таблица.Сортировать("РазмерЧисло, Размер, Полнота");

	Возврат Таблица;

КонецФункции

// Поля типа изделия с именами колонок матрицы (Поле1, Поле2, ...).
// Имена присваиваются по порядку сортировки, одинаковому при каждом вызове,
// поэтому форма может получить соответствие "колонка - поле" заново при записи.
Функция ПоляМатрицы(ТипИзделия) Экспорт

	Поля = ПоляТипаИзделия(ТипИзделия);
	Поля.Колонки.Добавить("ИмяКолонки", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(20)));

	Индекс = 0;
	Для Каждого СтрПоле Из Поля Цикл
		Индекс = Индекс + 1;
		СтрПоле.ИмяКолонки = "Поле" + Индекс;
	КонецЦикла;

	Возврат Поля;

КонецФункции

// Заголовок колонки: русское название, а если его нет - украинское.
Функция ЗаголовокПоля(СтрокаПоля) Экспорт

	Возврат ?(ПустаяСтрока(СтрокаПоля.НаименованиеРус), СтрокаПоля.Наименование, СтрокаПоля.НаименованиеРус);

КонецФункции

// Матрица замеров номенклатуры: строки - размеры, колонки - поля типа изделия.
//
// Возвращает структуру:
//   Таблица   - ТаблицаЗначений: Размер, Полнота, Поле1..ПолеN (числа);
//   Поля      - ТаблицаЗначений полей (см. ПоляТипаИзделия) + колонка ИмяКолонки;
//   ТипИзделия - значение свойства "Тип изделия" номенклатуры.
Функция МатрицаЗамеров(Номенклатура) Экспорт

	ТипИзд = ТипИзделия(Номенклатура);
	Поля = ПоляМатрицы(ТипИзд);

	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Размер", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(20)));
	Таблица.Колонки.Добавить("Полнота", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(20)));

	ОписаниеЗамера = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 2, ДопустимыйЗнак.Любой));
	Для Каждого СтрПоле Из Поля Цикл
		Колонка = Таблица.Колонки.Добавить(СтрПоле.ИмяКолонки, ОписаниеЗамера);
		Колонка.Заголовок = ЗаголовокПоля(СтрПоле);
	КонецЦикла;

	Размеры = РазмерыНоменклатуры(Номенклатура);
	Для Каждого СтрРазмер Из Размеры Цикл
		НоваяСтрока = Таблица.Добавить();
		НоваяСтрока.Размер = СтрРазмер.Размер;
		НоваяСтрока.Полнота = СтрРазмер.Полнота;
	КонецЦикла;

	Если Поля.Количество() = 0 ИЛИ Таблица.Количество() = 0 Тогда
		Возврат Новый Структура("Таблица,Поля,ТипИзделия", Таблица, Поля, ТипИзд);
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Замеры.Размер КАК Размер,
	               |	Замеры.Полнота КАК Полнота,
	               |	Замеры.ПолеЗамера КАК Поле,
	               |	Замеры.Замер КАК Замер
	               |ИЗ
	               |	РегистрСведений.Замеры КАК Замеры
	               |ГДЕ
	               |	Замеры.Номенклатура = &Номенклатура
	               |	И Замеры.ПолеЗамера В (&Поля)";
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Поля", Поля.ВыгрузитьКолонку("Поле"));

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл

		СтрокаПоля = Поля.Найти(Выборка.Поле, "Поле");
		Если СтрокаПоля = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		Отбор = Новый Структура("Размер,Полнота", СокрЛП(Выборка.Размер), СокрЛП(Выборка.Полнота));
		НайденныеСтроки = Таблица.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;

		НайденныеСтроки[0][СтрокаПоля.ИмяКолонки] = Выборка.Замер;

	КонецЦикла;

	Возврат Новый Структура("Таблица,Поля,ТипИзделия", Таблица, Поля, ТипИзд);

КонецФункции

// Записывает матрицу обратно в регистр Замеры.
// Для каждой пары (Размер, Полнота) набор записей перезаписывается целиком,
// поэтому попутно вычищаются дубли, оставшиеся от старого механизма.
Процедура ЗаписатьМатрицуЗамеров(Номенклатура, Матрица, Поля) Экспорт

	Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
		ВызватьИсключение "Не задана номенклатура: замеры записывать некуда.";
	КонецЕсли;

	НачатьТранзакцию();
	Попытка

		Для Каждого СтрокаМатрицы Из Матрица Цикл

			Если ПустаяСтрока(СтрокаМатрицы.Размер) Тогда
				Продолжить;
			КонецЕсли;

			Набор = РегистрыСведений.Замеры.СоздатьНаборЗаписей();
			Набор.Отбор.Номенклатура.Установить(Номенклатура);
			Набор.Отбор.Размер.Установить(СокрЛП(СтрокаМатрицы.Размер));
			Набор.Отбор.Полнота.Установить(СокрЛП(СтрокаМатрицы.Полнота));
			Набор.Прочитать();

			// набор записывается целиком, поэтому замеры по полям, которых нет
			// в матрице (поле отвязали от типа изделия, тип изделия сменили),
			// сначала сохраняем - иначе запись формы их бы стёрла
			Чужие = Новый Массив;
			Для Каждого Запись Из Набор Цикл
				Если Поля.Найти(Запись.ПолеЗамера, "Поле") = Неопределено Тогда
					Данные = Новый Структура("ПолеЗамера,Поле,ПолеРус,Замер");
					ЗаполнитьЗначенияСвойств(Данные, Запись);
					Чужие.Добавить(Данные);
				КонецЕсли;
			КонецЦикла;

			Набор.Очистить();

			Для Каждого Данные Из Чужие Цикл
				Запись = Набор.Добавить();
				Запись.Номенклатура = Номенклатура;
				Запись.Размер = СокрЛП(СтрокаМатрицы.Размер);
				Запись.Полнота = СокрЛП(СтрокаМатрицы.Полнота);
				ЗаполнитьЗначенияСвойств(Запись, Данные);
			КонецЦикла;

			Для Каждого СтрокаПоля Из Поля Цикл

				Замер = СтрокаМатрицы[СтрокаПоля.ИмяКолонки];
				Если НЕ ЗначениеЗаполнено(Замер) Тогда
					Продолжить;
				КонецЕсли;

				Запись = Набор.Добавить();
				Запись.Номенклатура = Номенклатура;
				Запись.Размер = СокрЛП(СтрокаМатрицы.Размер);
				Запись.Полнота = СокрЛП(СтрокаМатрицы.Полнота);
				Запись.ПолеЗамера = СтрокаПоля.Поле;
				Запись.Замер = Замер;
				// переходный период: старые строковые измерения заполняем параллельно
				Запись.Поле = Лев(СтрокаПоля.Наименование, 50);
				Запись.ПолеРус = Лев(СтрокаПоля.НаименованиеРус, 50);

			КонецЦикла;

			Набор.Записать(Истина);

		КонецЦикла;

		ЗафиксироватьТранзакцию();

	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

// Замеры другой номенклатуры для заполнения по образцу.
// Возвращает соответствие "размер + поле" -> замер. Полнота не учитывается:
// у модели-донора она может быть своя, а нужен просто размерный ряд.
Функция ЗамерыДляЗаполнения(НоменклатураОбразец) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Замеры.Размер КАК Размер,
	               |	Замеры.ПолеЗамера КАК Поле,
	               |	Замеры.Замер КАК Замер
	               |ИЗ
	               |	РегистрСведений.Замеры КАК Замеры
	               |ГДЕ
	               |	Замеры.Номенклатура = &Номенклатура
	               |	И Замеры.Замер > 0
	               |	И Замеры.ПолеЗамера <> ЗНАЧЕНИЕ(Справочник.ПоляЗамеров.ПустаяСсылка)";
	Запрос.УстановитьПараметр("Номенклатура", НоменклатураОбразец);

	Значения = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Значения.Вставить(КлючЗаполнения(Выборка.Размер, Выборка.Поле), Выборка.Замер);
	КонецЦикла;

	Возврат Значения;

КонецФункции

Функция КлючЗаполнения(Размер, Поле) Экспорт

	Возврат СокрЛП(Размер) + "|" + Строка(Поле.УникальныйИдентификатор());

КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Чтение замеров для прайса, выгрузок и описаний.

// Замеры номенклатуры в разрезе полей, заданных для её типа изделия.
// Колонки: Замер, Поле (укр.), ПолеРус, ПолеПеревод, Размер, Порядок.
//
// Читает только по ссылке ПолеЗамера. Если в базе остались незаполненные ссылки
// (перенос ещё не прогоняли), он запускается сам - выгрузки не должны зависеть
// от того, нажал кто-то кнопку переноса или нет.
Функция ЗамерыПоПолям(Номенклатура, Размер, Полнота, ВсеРазмеры = Ложь, ТолькоПоложительные = Ложь) Экспорт

	ЗамерыНоменклатурыПовтИсп.ПереносВыполнен();

	ТипИзд = ТипИзделия(Номенклатура);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ТипИзделия", ТипИзд);
	Запрос.УстановитьПараметр("Размер", Размер);
	Запрос.УстановитьПараметр("ВсеРазмеры", ВсеРазмеры);
	Запрос.УстановитьПараметр("Полнота", Полнота);
	Запрос.УстановитьПараметр("ПолнотаВыбрана", НЕ ЗначениеЗаполнено(Полнота));
	Запрос.УстановитьПараметр("ТолькоПоложительные", ТолькоПоложительные);

	Запрос.Текст = "ВЫБРАТЬ
	               |	Замеры.Замер КАК Замер,
	               |	Замеры.Размер КАК Размер,
	               |	Замеры.ПолеЗамера.Наименование КАК Поле,
	               |	Замеры.ПолеЗамера.НаименованиеРус КАК ПолеРус,
	               |	Замеры.ПолеЗамера.НаименованиеПеревод КАК ПолеПеревод,
	               |	Поля.Порядок КАК Порядок
	               |ИЗ
	               |	РегистрСведений.Замеры КАК Замеры
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПоляЗамеровПоТипамИзделия КАК Поля
	               |		ПО Поля.ПолеЗамера = Замеры.ПолеЗамера
	               |			И Поля.ТипИзделия = &ТипИзделия
	               |ГДЕ
	               |	Замеры.Номенклатура = &Номенклатура
	               |	И (Замеры.Полнота = &Полнота
	               |			ИЛИ &ПолнотаВыбрана)
	               |	И (Замеры.Размер = &Размер
	               |			ИЛИ &ВсеРазмеры)
	               |	И (Замеры.Замер > 0
	               |			ИЛИ НЕ &ТолькоПоложительные)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Поля.Порядок,
	               |	Поле";

	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Склейка полей-дублей.

// Переносит всё, что связано с полем-дублем, на основное поле:
// замеры номенклатуры, привязки к типам изделия, - и помечает дубль на удаление.
//
// Если и у дубля, и у основного поля есть замер по одному размеру,
// остаётся значение основного поля.
//
// ТолькоПроверка = Истина - ничего не меняет, только считает объём работы.
// Возвращает текстовый протокол.
Функция СклеитьПоля(Дубль, Основное, ТолькоПроверка = Ложь) Экспорт

	Протокол = Новый Массив;

	Если НЕ ЗначениеЗаполнено(Дубль) ИЛИ НЕ ЗначениеЗаполнено(Основное) Тогда
		Возврат "Укажите оба поля: какое склеиваем и во что.";
	КонецЕсли;

	Если Дубль = Основное Тогда
		Возврат "Это одно и то же поле.";
	КонецЕсли;

	Номенклатуры = НоменклатурыСПолем(Дубль);
	ТипыИзделия = ТипыИзделияСПолем(Дубль);

	Конфликтов = КонфликтующихЗамеров(Дубль, Основное);

	Протокол.Добавить("Убрать:   " + ОписаниеПоля(Дубль));
	Протокол.Добавить("Оставить: " + ОписаниеПоля(Основное));
	Протокол.Добавить("");
	Протокол.Добавить("Номенклатуры с замерами по убираемому полю: " + Номенклатуры.Количество());
	Протокол.Добавить("Типы изделия, где поле задано: " + ТипыИзделия.Количество());

	КодДубля = СокрЛП(Дубль.НаименованиеПеревод);
	КодОсновного = СокрЛП(Основное.НаименованиеПеревод);
	Если НЕ ПустаяСтрока(КодДубля) И НЕ ПустаяСтрока(КодОсновного) И КодДубля <> КодОсновного Тогда
		Протокол.Добавить("");
		Протокол.Добавить("ОСТОРОЖНО: у полей разные коды перевода для сайта (" + КодДубля + " и " + КодОсновного + ")."
			+ " Обычно это значит, что замеры разные по смыслу, а не написаны по-разному."
			+ " Проверьте русские названия, прежде чем склеивать.");
	КонецЕсли;

	Если Конфликтов > 0 Тогда
		Протокол.Добавить("ВНИМАНИЕ: по " + Конфликтов + " размерам заполнены оба поля."
			+ " Эти значения убираемого поля будут потеряны безвозвратно - останутся значения оставляемого поля.");
	Иначе
		Протокол.Добавить("Пересечений нет: все значения просто переедут, ничего не потеряется.");
	КонецЕсли;

	Если ТолькоПроверка Тогда
		Протокол.Добавить("Это проверка, ничего не изменено.");
		Возврат СтрСоединить(Протокол, Символы.ПС);
	КонецЕсли;

	НачатьТранзакцию();
	Попытка

		Замен = 0;
		Для Каждого СсылкаНоменклатуры Из Номенклатуры Цикл
			Замен = Замен + ПеренестиЗамерыНаПоле(СсылкаНоменклатуры, Дубль, Основное);
		КонецЦикла;

		Для Каждого ТипИзд Из ТипыИзделия Цикл
			ПеренестиПривязку(ТипИзд, Дубль, Основное);
		КонецЦикла;

		ИтогУдаления = УбратьПолеДубль(Дубль);

		ЗафиксироватьТранзакцию();

	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

	Протокол.Добавить("Записей замеров переведено: " + Замен);
	Протокол.Добавить(ИтогУдаления);

	Текст = СтрСоединить(Протокол, Символы.ПС);
	ЗаписьЖурналаРегистрации("Замеры.СклейкаПолей", УровеньЖурналаРегистрации.Информация, , , Текст);

	Возврат Текст;

КонецФункции

// Удаляет поле-дубль насовсем, но только если на него больше никто не ссылается.
// Если ссылки остались - ставит пометку удаления и говорит, кто держит.
Функция УбратьПолеДубль(Дубль)

	МассивСсылок = Новый Массив;
	МассивСсылок.Добавить(Дубль);
	Ссылки = НайтиПоСсылкам(МассивСсылок);

	Если Ссылки.Количество() = 0 Тогда
		Дубль.ПолучитьОбъект().Удалить();
		Возврат "Поле-дубль удалено.";
	КонецЕсли;

	Дубль.ПолучитьОбъект().УстановитьПометкуУдаления(Истина);

	Держатели = "";
	Для Каждого Стр Из Ссылки Цикл
		Если СтрНайти(Держатели, Строка(Стр.Метаданные)) = 0 Тогда
			Держатели = Держатели + ?(ПустаяСтрока(Держатели), "", ", ") + Строка(Стр.Метаданные);
		КонецЕсли;
	КонецЦикла;

	Возврат "Поле-дубль удалить не вышло: на него ещё ссылаются (" + Держатели + ")."
		+ " Поставлена пометка удаления.";

КонецФункции

Функция ОписаниеПоля(Поле)

	Описание = """" + Строка(Поле) + """";

	Если НЕ ПустаяСтрока(Поле.НаименованиеРус) Тогда
		Описание = Описание + " / " + СокрЛП(Поле.НаименованиеРус);
	КонецЕсли;

	Если НЕ ПустаяСтрока(Поле.НаименованиеПеревод) Тогда
		Описание = Описание + " / код " + СокрЛП(Поле.НаименованиеПеревод);
	КонецЕсли;

	Возврат Описание;

КонецФункции

// Сколько замеров по убираемому полю столкнётся с уже заполненными
// замерами оставляемого поля: ровно столько значений потеряется.
Функция КонфликтующихЗамеров(Дубль, Основное)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(*) КАК ВсегоКонфликтов
	               |ИЗ
	               |	РегистрСведений.Замеры КАК ЗамерыДубля
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Замеры КАК ЗамерыОсновного
	               |		ПО ЗамерыОсновного.Номенклатура = ЗамерыДубля.Номенклатура
	               |			И ЗамерыОсновного.Размер = ЗамерыДубля.Размер
	               |			И ЗамерыОсновного.Полнота = ЗамерыДубля.Полнота
	               |			И ЗамерыОсновного.ПолеЗамера = &Основное
	               |ГДЕ
	               |	ЗамерыДубля.ПолеЗамера = &Дубль
	               |	И ЗамерыДубля.Замер > 0
	               |	И ЗамерыОсновного.Замер > 0";
	Запрос.УстановитьПараметр("Дубль", Дубль);
	Запрос.УстановитьПараметр("Основное", Основное);

	Выборка = Запрос.Выполнить().Выбрать();

	Возврат ?(Выборка.Следующий(), Выборка.ВсегоКонфликтов, 0);

КонецФункции

Функция НоменклатурыСПолем(Поле)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	Замеры.Номенклатура КАК Номенклатура
	               |ИЗ
	               |	РегистрСведений.Замеры КАК Замеры
	               |ГДЕ
	               |	Замеры.ПолеЗамера = &Поле";
	Запрос.УстановитьПараметр("Поле", Поле);

	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Номенклатура");

КонецФункции

Функция ТипыИзделияСПолем(Поле)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Поля.ТипИзделия КАК ТипИзделия
	               |ИЗ
	               |	РегистрСведений.ПоляЗамеровПоТипамИзделия КАК Поля
	               |ГДЕ
	               |	Поля.ПолеЗамера = &Поле";
	Запрос.УстановитьПараметр("Поле", Поле);

	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ТипИзделия");

КонецФункции

// Перекладывает замеры номенклатуры с одного поля на другое.
// Набор переписывается целиком, поэтому дубли по ключу схлопываются здесь же.
Функция ПеренестиЗамерыНаПоле(Номенклатура, Дубль, Основное)

	Набор = РегистрыСведений.Замеры.СоздатьНаборЗаписей();
	Набор.Отбор.Номенклатура.Установить(Номенклатура);
	Набор.Прочитать();

	НаименованиеОсновного = Лев(СокрЛП(Основное.Наименование), 50);
	НаименованиеОсновногоРус = Лев(СокрЛП(Основное.НаименованиеРус), 50);

	Данные = Новый ТаблицаЗначений;
	Данные.Колонки.Добавить("Ключ");
	Данные.Колонки.Добавить("Размер");
	Данные.Колонки.Добавить("Полнота");
	Данные.Колонки.Добавить("ПолеЗамера");
	Данные.Колонки.Добавить("Поле");
	Данные.Колонки.Добавить("ПолеРус");
	Данные.Колонки.Добавить("Замер");
	Данные.Колонки.Добавить("ЭтоДубль");

	Замен = 0;
	Для Каждого Запись Из Набор Цикл

		ЭтоДубль = (Запись.ПолеЗамера = Дубль);
		ПолеЗаписи = ?(ЭтоДубль, Основное, Запись.ПолеЗамера);

		Ключ = СокрЛП(Запись.Размер) + "|" + СокрЛП(Запись.Полнота) + "|" + Строка(ПолеЗаписи.УникальныйИдентификатор());
		Существующая = Данные.Найти(Ключ, "Ключ");

		Если Существующая <> Неопределено Тогда
			// столкнулись замеры дубля и основного поля - оставляем основное
			Если Существующая.ЭтоДубль И НЕ ЭтоДубль Тогда
				Существующая.Замер = Запись.Замер;
				Существующая.ЭтоДубль = Ложь;
			КонецЕсли;
			Продолжить;
		КонецЕсли;

		НоваяСтрока = Данные.Добавить();
		НоваяСтрока.Ключ = Ключ;
		НоваяСтрока.Размер = Запись.Размер;
		НоваяСтрока.Полнота = Запись.Полнота;
		НоваяСтрока.ПолеЗамера = ПолеЗаписи;
		НоваяСтрока.Поле = ?(ЭтоДубль, НаименованиеОсновного, Запись.Поле);
		НоваяСтрока.ПолеРус = ?(ЭтоДубль, НаименованиеОсновногоРус, Запись.ПолеРус);
		НоваяСтрока.Замер = Запись.Замер;
		НоваяСтрока.ЭтоДубль = ЭтоДубль;

		Если ЭтоДубль Тогда
			Замен = Замен + 1;
		КонецЕсли;

	КонецЦикла;

	Набор.Очистить();
	Для Каждого СтрокаДанных Из Данные Цикл
		Запись = Набор.Добавить();
		Запись.Номенклатура = Номенклатура;
		ЗаполнитьЗначенияСвойств(Запись, СтрокаДанных, "Размер,Полнота,ПолеЗамера,Поле,ПолеРус,Замер");
	КонецЦикла;

	Набор.Записать(Истина);

	Возврат Замен;

КонецФункции

Процедура ПеренестиПривязку(ТипИзд, Дубль, Основное)

	ЗаписьДубля = РегистрыСведений.ПоляЗамеровПоТипамИзделия.СоздатьМенеджерЗаписи();
	ЗаписьДубля.ТипИзделия = ТипИзд;
	ЗаписьДубля.ПолеЗамера = Дубль;
	ЗаписьДубля.Прочитать();

	ЗаписьОсновного = РегистрыСведений.ПоляЗамеровПоТипамИзделия.СоздатьМенеджерЗаписи();
	ЗаписьОсновного.ТипИзделия = ТипИзд;
	ЗаписьОсновного.ПолеЗамера = Основное;
	ЗаписьОсновного.Прочитать();

	// основного поля у типа изделия ещё нет - переносим настройки дубля
	Если НЕ ЗаписьОсновного.Выбран() И ЗаписьДубля.Выбран() Тогда
		ПривязатьПоле(ТипИзд, Основное, ЗаписьДубля.ВПрайс, ЗаписьДубля.Порядок, ЗаписьДубля.Комм);
	КонецЕсли;

	ЗаписьДубля.Удалить();

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Перенос старых данных.

// Если в регистре остались замеры без ссылки на поле, переносит их прямо сейчас.
// Вызывается через ЗамерыНоменклатурыПовтИсп, то есть не чаще раза за сеанс.
Процедура ОбеспечитьПеренос() Экспорт

	Если НЕ ЕстьЗамерыБезСсылки() Тогда
		Возврат;
	КонецЕсли;

	ЗаписьЖурналаРегистрации("Замеры.Миграция", УровеньЖурналаРегистрации.Информация, , ,
		"Найдены замеры без ссылки на поле - перенос запущен автоматически.");

	ПеренестиСтарыеДанные();

КонецПроцедуры

Функция ЕстьЗамерыБезСсылки()

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	1 КАК Признак
	               |ИЗ
	               |	РегистрСведений.Замеры КАК Замеры
	               |ГДЕ
	               |	Замеры.ПолеЗамера = ЗНАЧЕНИЕ(Справочник.ПоляЗамеров.ПустаяСсылка)
	               |	И Замеры.Поле <> """"";

	Возврат НЕ Запрос.Выполнить().Пустой();

КонецФункции

// Переносит строковые названия полей в справочник ПоляЗамеров, набор полей -
// в ПоляЗамеровПоТипамИзделия, и проставляет ссылку ПолеЗамера в регистре Замеры.
//
// Запускается повторно без вреда: уже перенесённые записи пропускаются.
// Возвращает текстовый протокол.
Функция ПеренестиСтарыеДанные() Экспорт

	Протокол = Новый Массив;

	СозданоВсего = ПеренестиПоляТипов(Протокол);
	Протокол.Добавить("Поля справочника созданы/найдены: " + СозданоВсего);

	ЗаполненоЗаписей = ПроставитьСсылкиВЗамерах(Протокол);
	Протокол.Добавить("Записей замеров переведено на ссылку: " + ЗаполненоЗаписей);

	Текст = СтрСоединить(Протокол, Символы.ПС);
	ЗаписьЖурналаРегистрации("Замеры.Миграция", УровеньЖурналаРегистрации.Информация, , , Текст);

	Возврат Текст;

КонецФункции

Функция ПеренестиПоляТипов(Протокол)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЗамерыПоля.ТипИзделия КАК ТипИзделия,
	               |	ЗамерыПоля.Поле КАК Поле,
	               |	ЗамерыПоля.ПолеРус КАК ПолеРус,
	               |	ЗамерыПоля.ПолеПеревод КАК ПолеПеревод,
	               |	ЗамерыПоля.ВПрайс КАК ВПрайс,
	               |	ЗамерыПоля.Комм КАК Комм
	               |ИЗ
	               |	РегистрСведений.ЗамерыПоля КАК ЗамерыПоля";

	Выборка = Запрос.Выполнить().Выбрать();
	Всего = 0;
	Порядок = 0;

	Пока Выборка.Следующий() Цикл

		Наим = СокрЛП(Выборка.Поле);
		Если ПустаяСтрока(Наим) Тогда
			Продолжить;
		КонецЕсли;

		Поле = ПолеПоНаименованию(Наим, Выборка.ПолеРус, Выборка.ПолеПеревод);
		Всего = Всего + 1;

		Если ЗначениеЗаполнено(Выборка.ТипИзделия) Тогда
			Порядок = Порядок + 10;
			ПривязатьПоле(Выборка.ТипИзделия, Поле, Выборка.ВПрайс, Порядок, Выборка.Комм);
		Иначе
			Протокол.Добавить("Поле """ + Наим + """ не привязано: в старой записи не задан тип изделия.");
		КонецЕсли;

	КонецЦикла;

	Возврат Всего;

КонецФункции

Функция ПроставитьСсылкиВЗамерах(Протокол)

	// соответствие "название поля" -> ссылка, чтобы не дёргать справочник в цикле
	Соответствие = Новый Соответствие;
	Выбор = Справочники.ПоляЗамеров.Выбрать();
	Пока Выбор.Следующий() Цикл
		Соответствие.Вставить(ВРег(СокрЛП(Выбор.Наименование)), Выбор.Ссылка);
	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	Замеры.Номенклатура КАК Номенклатура
	               |ИЗ
	               |	РегистрСведений.Замеры КАК Замеры
	               |ГДЕ
	               |	Замеры.ПолеЗамера = ЗНАЧЕНИЕ(Справочник.ПоляЗамеров.ПустаяСсылка)
	               |	И Замеры.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)";

	Номенклатуры = Запрос.Выполнить().Выгрузить();
	Заполнено = 0;
	НеНайдено = Новый Соответствие;

	Для Каждого СтрНоменклатура Из Номенклатуры Цикл

		Набор = РегистрыСведений.Замеры.СоздатьНаборЗаписей();
		Набор.Отбор.Номенклатура.Установить(СтрНоменклатура.Номенклатура);
		Набор.Прочитать();

		ЕстьИзменения = Ложь;
		Для Каждого Запись Из Набор Цикл

			Если ЗначениеЗаполнено(Запись.ПолеЗамера) Тогда
				Продолжить;
			КонецЕсли;

			Ключ = ВРег(СокрЛП(Запись.Поле));
			Поле = Соответствие.Получить(Ключ);

			Если Поле = Неопределено Тогда
				// поля не было в ЗамерыПоля - заводим по названию из самой записи
				Если ПустаяСтрока(Ключ) Тогда
					Продолжить;
				КонецЕсли;
				Поле = ПолеПоНаименованию(СокрЛП(Запись.Поле), Запись.ПолеРус);
				Соответствие.Вставить(Ключ, Поле);
				НеНайдено.Вставить(Ключ, Истина);
			КонецЕсли;

			Запись.ПолеЗамера = Поле;
			ЕстьИзменения = Истина;
			Заполнено = Заполнено + 1;

		КонецЦикла;

		Если ЕстьИзменения Тогда
			Набор.Записать(Истина);
		КонецЕсли;

	КонецЦикла;

	Для Каждого КлючЗначение Из НеНайдено Цикл
		Протокол.Добавить("Поле """ + КлючЗначение.Ключ + """ было только в замерах, заведено в справочнике.");
	КонецЦикла;

	Возврат Заполнено;

КонецФункции
